# Week 4: Python + Some More Pandas

Select your Kernel!

### 1 - Imports

In [34]:
import pandas as pd

data = {
    'Name': ['Zophie', 'Alice', 'Bob', 'Charlie', 'Max', 'Milo', 'Luna', 'Bella'],
    'Age': [7, 5, 3, 2, 5, 3, 2, 5],
    'Color': ['Gray', 'Black', 'Brown', 'White', 'Black', 'Brown', 'White', 'Black'],
    'Owner': ['Charles', 'Charles', 'Cj', 'Cj', 'Cj', 'Charles', 'Cj', 'Charles'],
    'Type': ['Cat', 'Cat', 'Dog', 'Dog', 'Dog', 'Cat', 'Dog', 'Cat']
}

### 2 - Python Control Flow

In [35]:
# Example For Loop

for i in range(1,10,1):
    print(i)
    
# Write a for loop to print even numbers between -4 to 40

1
2
3
4
5
6
7
8
9

In [49]:
# Example if/else if/else clause

g = int(input("Enter a number"))

if g < 0:
    print("Neg")
elif g < 10:
    print("Small")
else:
    print("Large asf!")
    
# Write an for + if/else clause that checks if pets are older/younger than 4
# Note that length of data isn't len(data) but len(data['Name])


# Do the same by converting to a dataframe and using 
df = pd.DataFrame(data)

Small

In [50]:
# Example While Loop
i = 0

while i < 10:
    print("I love CJ!")
    i = i + 1

colors = list(df['Color'])
# Create a while loop that goes through colors until it gets to white, then prints out index

I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!
I love CJ!

In [51]:
# Example List Comprehension

bops = [x for x in range(1,10)]
bops

# Example map

top = list(map(lambda x: x**2, bops))
top

# Redo top but use a named function instead of lambda

[1, 4, 9, 16, 25, 36, 49, 64, 81]

3 - Pandas

In [52]:
# Example of .split()
df = pd.DataFrame({'Full Name': ['Charlie Brown', 'Alice Smith']})
df[['First', 'Last']] = df['Full Name'].str.split(' ', expand=True)
print(df)

#

       Full Name    First   Last
0  Charlie Brown  Charlie  Brown
1    Alice Smith    Alice  Smith

In [53]:
# Example of .isin()
df = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']})
mask = df['Name'].isin(['Alice', 'Charlie'])
print(df[mask])

      Name
0    Alice
2  Charlie

In [54]:
# Example of .merge()
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [30, 25, 40]})

In [55]:
pd.merge(df1, df2, on='ID', how='inner')

   ID     Name  Age
0   2      Bob   30
1   3  Charlie   25

In [56]:
pd.merge(df1, df2, on='ID', how='outer')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  30.0
2   3  Charlie  25.0
3   4      NaN  40.0

In [57]:
pd.merge(df1, df2, on='ID', how='left')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  30.0
2   3  Charlie  25.0

In [58]:
pd.merge(df1, df2, on='ID', how='right')

   ID     Name  Age
0   2      Bob   30
1   3  Charlie   25
2   4      NaN   40

In [59]:
# Use all three!
customers = pd.DataFrame({
    'FullName': ['Alice Johnson', 'Bob Smith', 'Charlie Brown'],
    'Phone': ['555-1234', '555-5678', '555-9999'],
    'Email': ['alice@email.com', 'bob@email.com', 'charlie@email.com']
})

appointments = pd.DataFrame({
    'Owner': ['Bob Smith', 'Charlie Brown', 'Dana White'],
    'Pet': ['Rex', 'Whiskers', 'Bubbles'],
    'Date': ['2025-04-23', '2025-04-24', '2025-04-25']
})

# create a df that splits customers names, filters only customers with appointments, then merges